---
kind: other
id: Methods.T:Autodesk.Revit.DB.Events.FileImportingEventArgs
source: html/cf039a64-806a-2586-e7f0-0ad2b3f0d5ed.htm
---
# FileImportingEventArgs Methods

When the event is cancellable, may call the Cancel() method to cancel it.